load_tests/jmeter.log
2018/01/15 14:51:27 INFO  - jmeter.util.JMeterUtils: Setting Locale to en_US 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Loading user properties from: /jmeter/apache-jmeter-2.13/bin/user.properties 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Loading system properties from: /jmeter/apache-jmeter-2.13/bin/system.properties 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Setting JMeter property: testData=requests.csv 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Setting JMeter property: numThreads=30 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Setting JMeter property: numRampUp=0 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Setting JMeter property: numIterations=250 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Setting System property: java.rmi.server.hostname=10.40.235.120 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Setting System property: client.rmi.localport=60000 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Copyright (c) 1998-2015 The Apache Software Foundation 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Version 2.13 r1665067 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: java.version=1.8.0_91 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: java.vm.name=OpenJDK 64-Bit Server VM 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: os.name=Linux 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: os.arch=amd64 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: os.version=4.4.0-101-generic 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: file.encoding=ANSI_X3.4-1968 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Default Locale=English (United States) 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: JMeter  Locale=English (United States) 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: JMeterHome=/jmeter/apache-jmeter-2.13 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: user.dir  =/loadtest/load_tests 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: PWD       =/loadtest/load_tests 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: IP: 172.17.0.2 Name: c7a951f60b5a FullName: c7a951f60b5a 
2018/01/15 14:51:27 INFO  - jmeter.services.FileServer: Default base='/loadtest/load_tests' 
2018/01/15 14:51:27 INFO  - jmeter.services.FileServer: Set new base='/loadtest/load_tests' 
2018/01/15 14:51:27 INFO  - jmeter.save.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2 
2018/01/15 14:51:27 INFO  - jmeter.save.SaveService: Using SaveService properties file encoding UTF-8 
2018/01/15 14:51:27 INFO  - jmeter.save.SaveService: Using SaveService properties file version 1656252 
2018/01/15 14:51:27 INFO  - jmeter.save.SaveService: Using SaveService properties version 2.8 
2018/01/15 14:51:27 INFO  - jmeter.save.SaveService: All converter versions present and correct 
2018/01/15 14:51:27 INFO  - jmeter.save.SaveService: Loading file: CMS_JMeter_Skript.jmx 
2018/01/15 14:51:27 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Cannot find .className property for htmlParser, using default 
2018/01/15 14:51:27 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/html is  
2018/01/15 14:51:27 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xhtml+xml is  
2018/01/15 14:51:27 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xml is  
2018/01/15 14:51:27 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/xml is  
2018/01/15 14:51:27 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser 
2018/01/15 14:51:27 INFO  - jmeter.JMeter: Creating summariser <summary> 
2018/01/15 14:51:27 INFO  - jmeter.engine.DistributedRunner: Configuring remote engine: 10.40.235.121 
2018/01/15 14:51:27 INFO  - jmeter.engine.DistributedRunner: Starting remote engines 
2018/01/15 14:51:27 INFO  - jmeter.engine.DistributedRunner: Starting the test @ Mon Jan 15 14:51:27 UTC 2018 (1516027887877) 
2018/01/15 14:51:27 INFO  - jmeter.engine.ClientJMeterEngine: running clientengine run method 
2018/01/15 14:51:27 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must contain the string: '.functions.' 
2018/01/15 14:51:27 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must not contain the string: '.gui.' 
2018/01/15 14:51:27 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2018/01/15 14:51:27 INFO  - jmeter.samplers.BatchSampleSender: Using batching (client settings) for this run. Thresholds: num=100, time=60000 
2018/01/15 14:51:27 INFO  - jmeter.samplers.DataStrippingSampleSender: Using DataStrippingSampleSender for this run 
2018/01/15 14:51:28 INFO  - jmeter.engine.ClientJMeterEngine: sent test to 10.40.235.121 basedir='.' 
2018/01/15 14:51:28 INFO  - jmeter.engine.ClientJMeterEngine: Sending properties {} 
2018/01/15 14:51:28 INFO  - jmeter.engine.ClientJMeterEngine: sent run command to 10.40.235.121 
2018/01/15 14:51:28 INFO  - jmeter.engine.DistributedRunner: Remote engines have been started 
2018/01/15 14:51:28 INFO  - jmeter.JMeter: Started remote host:  10.40.235.121 (1516027888385) 
2018/01/15 14:51:28 INFO  - jmeter.samplers.SampleResult: Note: Sample TimeStamps are START times 
2018/01/15 14:51:28 INFO  - jmeter.samplers.SampleResult: sampleresult.default.encoding is set to ISO-8859-1 
2018/01/15 14:51:28 INFO  - jmeter.samplers.SampleResult: sampleresult.useNanoTime=true 
2018/01/15 14:51:28 INFO  - jmeter.samplers.SampleResult: sampleresult.nanoThreadSleep=5000 
2018/01/15 14:51:29 INFO  - jmeter.reporters.Summariser: summary =      3 in     1s =    4.2/s Avg:    16 Min:    11 Max:    22 Err:     0 (0.00%) 
2018/01/15 14:51:29 INFO  - jmeter.JMeter: Finished remote host: 10.40.235.121 (1516027889105) 
2018/01/15 14:51:34 INFO  - jmeter.JMeter: Interrupting RMI Reaper